**Exercise 1**.

- Create the `mtcars` DataFrame from this URL `https://bit.ly/3oAZyrd`
- Find the mean `wt` by number of cylinders sorted in decreasing order, keeping the result as a DataFrame.
- Find all car models that have numbers in the name
- Create a correlation matrix of `hp`, `weight` and `qsec` for cars with 4 gears

In [1]:
import pandas as pd

In [2]:
url = 'https://bit.ly/3oAZyrd'

mtcars = pd.read_csv(url)

In [3]:
mtcars.head(3)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

In [4]:
mtcars.groupby('cyl')[['wt']].mean().sort_values('wt', ascending=False)

           wt
cyl
8    3.999214
6    3.117143
4    2.285727

In [5]:
mtcars.model[mtcars.model.str.contains(r'\d+')]

0          Mazda RX4
1      Mazda RX4 Wag
2         Datsun 710
3     Hornet 4 Drive
6         Duster 360
7          Merc 240D
8           Merc 230
9           Merc 280
10         Merc 280C
11        Merc 450SE
12        Merc 450SL
13       Merc 450SLC
17          Fiat 128
23        Camaro Z28
25         Fiat X1-9
26     Porsche 914-2
31        Volvo 142E
Name: model, dtype: object

In [6]:
mtcars[mtcars.gear==4][['hp', 'wt', 'qsec']].corr()

            hp        wt      qsec
hp    1.000000  0.734547 -0.320707
wt    0.734547  1.000000  0.104589
qsec -0.320707  0.104589  1.000000

**Exercise 2**.

- Convert the data in `mess.txt` to the DataFrame in `tidy.csv` using Pandas operations

In [7]:
df = pd.read_csv('mess.txt', sep=' ')

In [8]:
final = pd.read_csv('tidy.csv')

In [9]:
df[['name', 'age', 'site']] = df.desc.str.split('-', expand=True)

In [10]:
df = df.drop(columns='desc')

In [11]:
df = pd.melt(df, id_vars=['name', 'age', 'site'], var_name='gene', value_name='expression')

In [12]:
df['gene'] = df.gene.str.replace('gene', '')

In [13]:
df.sort_values('name')

   name age  site gene  expression
0     a  23  duke    1        11.2
4     a  23  duke    2        12.3
8     a  23  duke    3        13.4
1     b  34   unc    1        10.7
5     b  34   unc    2        13.4
9     b  34   unc    3         9.8
2     c  44  duke    1         9.0
6     c  44  duke    2         9.9
10    c  44  duke    3        14.2
3     d  42   unc    1        11.6
7     d  42   unc    2        10.7
11    d  42   unc    3         8.9

**Exercise 3**.

- Repeat exercise 2 as a single chained command. (Challenging)

In [14]:
(
    pd.read_csv('mess.txt', sep=' ').
    assign(
        name = lambda x: x.desc.str.split('-').str[0],
        age = lambda x: x.desc.str.split('-').str[1],
        site = lambda x: x.desc.str.split('-').str[2]
    ).drop(columns=['desc']).
    melt(id_vars=['name', 'age', 'site'], var_name='gene', value_name='expression').
    assign(gene=lambda x: x.gene.str.replace('gene', '')).
    sort_values('name')
)

   name age  site gene  expression
0     a  23  duke    1        11.2
4     a  23  duke    2        12.3
8     a  23  duke    3        13.4
1     b  34   unc    1        10.7
5     b  34   unc    2        13.4
9     b  34   unc    3         9.8
2     c  44  duke    1         9.0
6     c  44  duke    2         9.9
10    c  44  duke    3        14.2
3     d  42   unc    1        11.6
7     d  42   unc    2        10.7
11    d  42   unc    3         8.9